ИС_СПОРТ_2022/src/DataProcessors/ЗаполнениеСогласияНаОбработкуПерсональныхДанных/ЗаполнениеСогласияНаОбработкуПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеСогласияНаОбработкуПерсональныхДанных</name>
</mdclass:DataProcessor>

ИС_СПОРТ_2022/src/Documents/ЗаявленияНаПриемВСпортивноеУчреждение/ЗаявленияНаПриемВСпортивноеУчреждение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявленияНаПриемВСпортивноеУчреждение</name>
  <registerRecords>InformationRegister.ПредоставленныеДокументыСпортсменов</registerRecords>
  <registerRecords>InformationRegister.СоставУчащихсяСпортивногоУчреждения</registerRecords>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобенностиРазвитияИЗдоровьяСпортсмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласиеНаОбработкуПерсональныхДанныхПолучено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСогласиеНаОбработкуПерсональныхДанных</name>
    <type>
      <types>DocumentRef.СогласиеНаОбработкуПерсональныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерновикЗаявления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗаявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявления</name>
    <type>
      <types>EnumRef.СтатусыЗаявленийНаПриемВСпортивноеУчреждение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоИзВнешнегоИсточника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредоставленныеДокументы</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.ВидыДокументовДляПриемаВСпортивноеУчреждение</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредоставленаКопия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлДокумента</name>
      <type>
        <types>CatalogRef.ЗаявленияНаПриемВСпортивноеУчреждениеПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/СогласиеНаОбработкуПерсональныхДанных/СогласиеНаОбработкуПерсональныхДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласиеНаОбработкуПерсональныхДанных</name>
  <basedOn>Document.ЗаявленияНаПриемВСпортивноеУчреждение</basedOn>
  <registerRecords>InformationRegister.СогласияНаОбработкуПерсональныхДанных</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОрганизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдресОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработкуПерсональныхДанных</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИООтветственногоЗаОбработкуПДн</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСубъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСубъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортныеДанные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СубъектЗаконныйПредставитель</name>
    <type>
      <types>CatalogRef.РодителиЗаконныеПредставителиСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСубъектаЗаконногоПредставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСубъектаЗаконногоПредставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортныеДанныеЗаконногоПредставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/DataProcessors/ЗаполнениеСогласияНаОбработкуПерсональныхДанных/Forms/Форма/Module.bsl
// {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	// {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
	// Удаление фигурных скобок, добавление/удаление лишних пробелов и иные исправления
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("СрокДействия", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Ссылка КАК Ссылка,
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Организация КАК Организация,
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Спортсмен КАК Спортсмен,
		|	СогласиеНаОбработкуПерсональныхДанных.Ссылка КАК ДокументСогласиеНаОбработкуПерсональныхДанных,
		|	ТИПЗНАЧЕНИЯ(ЗаявленияНаПриемВСпортивноеУчреждение.ДокументСогласиеНаОбработкуПерсональныхДанных) КАК Поле1
		|ПОМЕСТИТЬ ВТ_ВсеЗаявления
		|ИЗ
		|	Документ.ЗаявленияНаПриемВСпортивноеУчреждение КАК ЗаявленияНаПриемВСпортивноеУчреждение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СогласиеНаОбработкуПерсональныхДанных КАК СогласиеНаОбработкуПерсональныхДанных
		|		ПО ЗаявленияНаПриемВСпортивноеУчреждение.ДокументСогласиеНаОбработкуПерсональныхДанных = СогласиеНаОбработкуПерсональныхДанных.Ссылка
		|ГДЕ
		|	ЗаявленияНаПриемВСпортивноеУчреждение.Организация = &Организация
		|	И ЗаявленияНаПриемВСпортивноеУчреждение.ДатаЗаявления МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ЗаявленияНаПриемВСпортивноеУчреждение.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СогласиеНаОбработкуПерсональныхДанных.Ссылка, ЗНАЧЕНИЕ(Документ.СогласиеНаОбработкуПерсональныхДанных.ПустаяСсылка)) КАК ДокументСогласия,
		|	СогласиеНаОбработкуПерсональныхДанных.Проведен КАК Проведен,
		|	ЕСТЬNULL(СогласиеНаОбработкуПерсональныхДанных.ПометкаУдаления, ЛОЖЬ) КАК ПометкаУдаления,
		|	СогласиеНаОбработкуПерсональныхДанных.СрокДействия КАК СрокДействия,
		|	ВТ_ВсеЗаявления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПредположительныеСогласия
		|ИЗ
		|	ВТ_ВсеЗаявления КАК ВТ_ВсеЗаявления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СогласиеНаОбработкуПерсональныхДанных КАК СогласиеНаОбработкуПерсональныхДанных
		|		ПО ВТ_ВсеЗаявления.Организация = СогласиеНаОбработкуПерсональныхДанных.Организация
		|			И ВТ_ВсеЗаявления.Спортсмен = СогласиеНаОбработкуПерсональныхДанных.Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПредположительныеСогласия.ДокументСогласия КАК ДокументСогласия,
		|	ВТ_ПредположительныеСогласия.ПометкаУдаления КАК ПометкаУдаления,
		|	ВТ_ПредположительныеСогласия.Проведен КАК Проведен,
		|	ВТ_ПредположительныеСогласия.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПодходящиеЗаявления
		|ИЗ
		|	ВТ_ПредположительныеСогласия КАК ВТ_ПредположительныеСогласия
		|ГДЕ
		|	ВТ_ПредположительныеСогласия.ПометкаУдаления = ЛОЖЬ
		|	И (ВТ_ПредположительныеСогласия.СрокДействия > &СрокДействия
		|			ИЛИ ВТ_ПредположительныеСогласия.СрокДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПодходящиеЗаявления.ДокументСогласия КАК ДокументСогласия,
		|	ВТ_ПодходящиеЗаявления.Проведен КАК Проведен,
		|	ВТ_ВсеЗаявления.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ВсеЗаявления КАК ВТ_ВсеЗаявления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПодходящиеЗаявления КАК ВТ_ПодходящиеЗаявления
		|		ПО ВТ_ВсеЗаявления.Ссылка = ВТ_ПодходящиеЗаявления.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументСогласия) Тогда
			  
			  Док.ДокументСогласиеНаОбработкуПерсональныхДанных = ВыборкаДетальныеЗаписи.ДокументСогласия;
			  
			  
			  Если Не ВыборкаДетальныеЗаписи.Проведен Тогда
				  Согласие = ВыборкаДетальныеЗаписи.ДокументСогласия.ПолучитьОбъект();
				  Попытка
					  Согласие.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				  Исключение
					  // {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
					  ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ согласия на обработку персональных данных, проверте документ" + Согласие);
					  // }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
				  КонецПопытки;
			  КонецЕсли;
			  Попытка
				  Док.СогласиеНаОбработкуПерсональныхДанныхПолучено = Истина; 
				  Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				  // {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
				  ОбщегоНазначения.СообщитьПользователю("Документ " + Док + " успешно перепроведен!");
				  // }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
			  Исключение
				  // {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
				  ОбщегоНазначения.СообщитьПользователю("Не удалось провести " + Док);
				  // }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
			  КонецПопытки;
		Иначе
			// Паспортные данные спортсмена
			ДанныеСубъектаСпортсмен = ЗащитаПерсональныхДанных.ОписаниеДанныхСубъекта();		
			ДанныеСубъектаСпортсмен.Субъект = Док.Спортсмен.ФизическоеЛицо;
			
			ЗащитаПерсональныхДанныхПереопределяемый.ДополнитьДанныеСубъектовПерсональныхДанных(ДанныеСубъектаСпортсмен, Док.ДатаЗаявления);
			
			///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
			// Паспортные данные спортсмена родителя
			ДанныеСубъектаЗаконногоПредставителя = ЗащитаПерсональныхДанных.ОписаниеДанныхСубъекта();		
			ДанныеСубъектаЗаконногоПредставителя.Субъект = Док.Родитель.ФизическоеЛицо;
			
			ЗащитаПерсональныхДанныхПереопределяемый.ДополнитьДанныеСубъектовПерсональныхДанных(ДанныеСубъектаЗаконногоПредставителя, Док.ДатаЗаявления);
			
			// Создаем новый документ согласия на обрабтку персональных данных;
			СогласиеНаОбработкуПерсональныхДанных = Документы.СогласиеНаОбработкуПерсональныхДанных.СоздатьДокумент();
			СогласиеНаОбработкуПерсональныхДанных.Дата 										= Док.ДатаЗаявления;
			СогласиеНаОбработкуПерсональныхДанных.Субъект 									= Док.Спортсмен;
			СогласиеНаОбработкуПерсональныхДанных.СубъектЗаконныйПредставитель 				= Док.Родитель;
			СогласиеНаОбработкуПерсональныхДанных.Организация                   			= Док.Организация;
			СогласиеНаОбработкуПерсональныхДанных.ДатаПолучения                             = Док.ДатаЗаявления;
			СогласиеНаОбработкуПерсональныхДанных.ПаспортныеДанные                       	= ДанныеСубъектаСпортсмен.ПаспортныеДанные;
			СогласиеНаОбработкуПерсональныхДанных.ФИОСубъекта                               = ДанныеСубъектаСпортсмен.ФИО;
			СогласиеНаОбработкуПерсональныхДанных.АдресСубъекта                             = ДанныеСубъектаСпортсмен.Адрес;
			СогласиеНаОбработкуПерсональныхДанных.ПаспортныеДанныеЗаконногоПредставителя 	= ДанныеСубъектаЗаконногоПредставителя.ПаспортныеДанные;
			СогласиеНаОбработкуПерсональныхДанных.ФИОСубъектаЗаконногоПредставителя         = ДанныеСубъектаЗаконногоПредставителя.ФИО;
			СогласиеНаОбработкуПерсональныхДанных.АдресСубъектаЗаконногоПредставителя       = ДанныеСубъектаЗаконногоПредставителя.Адрес;
			СогласиеНаОбработкуПерсональныхДанных.Ответственный                             = Док.Ответственный;
			СогласиеНаОбработкуПерсональныхДанных.Комментарий                               = Док.Комментарий;
			
			СогласиеНаОбработкуПерсональныхДанных.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			Док.ДокументСогласиеНаОбработкуПерсональныхДанных = СогласиеНаОбработкуПерсональныхДанных.Ссылка;
			Док.СогласиеНаОбработкуПерсональныхДанныхПолучено = Истина;
			
			Попытка	
				Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				// {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
				ОбщегоНазначения.СообщитьПользователю("Документ " + Док + " успешно перепроведен!");
				// }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
	     	Исключение
				// {Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
				ОбщегоНазначения.СообщитьПользователю("Не удалось провести " + Док);
				// }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	// }Рарус adilas #1.0.0.2 -SonarQube 2021.04.23

КонецПроцедуры

#КонецОбласти
